app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
  	@user = User.new user_params
  	if @user.save

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$R1KMWc16MNr7Qh/rj81mMe.zHxdt3nLN9tNfWaSgujr9HKW3LBMre"], ["updated_at", "2016-01-14 14:22:26.809452"], ["id", 3]]
---
  def update
    @user = current_user
    if @user.update_attributes(user_params)